#+title: Emacs Unfiled Projects

* NOV

#+begin_src emacs-lisp
  (use-package nov
    :straight t
    :config

    (defun actuator-novel-setup ()
      (face-remap-add-relative 'variable-pitch :family "Georgia"
                               :height 1.3)
      (setq-local line-spacing 1.2))
    (add-hook 'nov-mode-hook 'actuator-novel-setup)

    (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
    :custom
    (nov-text-width 65))
#+end_src

#+results:
: t

#+begin_src emacs-lisp
  (setq org-tag-persistent-alist '(("doing" . d) ("health" h) ("actuator" a)))
#+end_src

#+results:
: ((doing . d) (health h) (actuator a))
* Cancel GC in Minibuffer
#+begin_src emacs-lisp
  (defun actuator-minibuffer-setup-hook ()
    (setq gc-cons-threshold (* 500 1024 1024)))

  (defun actuator-minibuffer-exit-hook ()
    (setq gc-cons-threshold 800000))

  (add-hook 'minibuffer-setup-hook #'actuator-minibuffer-setup-hook)
  (add-hook 'minibuffer-exit-hook  #'actuator-minibuffer-exit-hook)
#+end_src

#+results:
| actuator-minibuffer-exit-hook |

